config/doom/config.org
#+TITLE: My configuration
#+date: 2021-7-19
#+STARTUP: content
* Introduction
This is my literate configuration for doom emacs. I barley know [[https://learnxinyminutes.com/docs/elisp/][elisp]]  and I have
mostly stolen snippets from others. This config is [[elisp:(count-words (point-min) (point-max))][this many]] words, lines and
characters long. Its a lot of blood sweat and tears so I hope you like it as much
as I tolerate it!

#+begin_quote
Do note I don't try to explain how things work but I do try to explain my
motivation behind my config. I was told this is not the norm but this is my
config and =C-h f= exists so you can go have a look
#+end_quote

Lets get this config started!
#+BEGIN_SRC emacs-lisp
;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-
;; Don't edit this file directly unless you like your changes being wiped
#+END_SRC

** Table of Contents :TOC_3:
- [[#introduction][Introduction]]
- [[#rudimentary-configuration][Rudimentary configuration]]
  - [[#keybinds][Keybinds]]
  - [[#hooky-hooks][Hooky hooks]]
  - [[#cli-commands][cli commands]]
  - [[#funky-functions][funky functions]]
  - [[#macros][macros]]
  - [[#random-modes][Random modes]]
    - [[#display-time-mode][display time mode]]
    - [[#globalsubword-mode][GlobalSubWord Mode]]
    - [[#type-break-mode][Type break mode]]
    - [[#battery-mode][Battery mode]]
    - [[#whitespace-mode][whitespace mode]]
  - [[#popup-rules][popup rules]]
- [[#packages][Packages]]
  - [[#ui][ui]]
    - [[#modeline-fun][modeline fun]]
    - [[#sidebars][sidebars]]
    - [[#themes][themes]]
  - [[#checkers][checkers]]
    - [[#flymake-vale][Flymake Vale]]
  - [[#emacs][emacs]]
    - [[#dired][dired]]
  - [[#tools][tools]]
    - [[#pretty-code-shots][pretty code shots]]
    - [[#snippets][snippets]]
    - [[#dictionary][dictionary]]
    - [[#info][info]]
  - [[#lang][lang]]
    - [[#org-mode][org mode]]
    - [[#emacs-lisp][emacs lisp]]
    - [[#sql][SQL]]
    - [[#caddy][Caddy]]
    - [[#vim][vim]]
    - [[#unit-tests][unit tests]]
    - [[#janet][janet]]
    - [[#shell][shell]]
  - [[#app][app]]
    - [[#books][books]]
    - [[#tldr-integration][tldr integration]]
    - [[#rss][rss]]
  - [[#other][other]]
    - [[#tetris][tetris]]
    - [[#fixes][fixes]]
    - [[#discord-rich-presence][discord rich presence]]
    - [[#arrows][arrows]]
- [[#modules][Modules]]
  - [[#completion][completion]]
    - [[#company][company]]
    - [[#deprecated-ivy][DEPRECATED ivy]]
    - [[#vertico][vertico]]
  - [[#editor][editor]]
    - [[#evil][evil]]
  - [[#ui-1][ui]]
    - [[#doom][Doom]]
    - [[#doom-dashboard][Doom Dashboard]]
    - [[#hl-todo][Hl TODO]]
    - [[#popup][Popup]]
    - [[#modeline][Modeline]]
    - [[#treemacs][Treemacs]]
    - [[#workspaces][Workspaces]]
  - [[#tools-1][tools]]
    - [[#eval][eval]]
    - [[#magit][magit]]
    - [[#lsp][lsp]]
    - [[#pdf][pdf]]
    - [[#tmux][tmux]]
    - [[#tree-sitter][tree-sitter]]
  - [[#emacs-1][emacs]]
    - [[#dired-1][dired]]
  - [[#term][term]]
    - [[#eshell][eshell]]
  - [[#checkers-1][checkers]]
    - [[#spell][spell]]
  - [[#lang-1][lang]]
    - [[#emacs-lisp-1][emacs-lisp]]
    - [[#org][org]]
    - [[#haskell][haskell]]
    - [[#python][python]]
    - [[#racket][racket]]
    - [[#latex][LaTeX]]
    - [[#web][Web]]
  - [[#app-1][app]]
    - [[#irc][irc]]
    - [[#rss-1][rss]]
    - [[#mu4e][mu4e]]
    - [[#everywhere][everywhere]]
- [[#epilogue][Epilogue]]

* Rudimentary configuration
This is the stuff that does not really belong in any module but is useful
#+BEGIN_SRC emacs-lisp
(message "in config")
(load! "+private.el") ;; Stuff I don't want on the web (emails and other boring things)
(setq user-full-name "Jeetaditya Chatterjee"
      user-mail-address "jeetelongname@gmail.com" ;; god I can't wait to get away from gmail
      doom-scratch-initial-major-mode 'lisp-interaction-mode
      auth-sources '("~/.authinfo.gpg")
      ispell-dictionary "en"
      display-line-numbers-type 'relative ;; this is a reminder that I should try and use relative actions more
      browse-url-browser-function 'browse-url-firefox)

(when (boundp 'native-comp-async-jobs-number)
  (setq native-comp-async-jobs-number 9))

(when (boundp 'pgtk-wait-for-event-timeout)
  (setq pgtk-wait-for-event-timeout 0.001))

(setq doom-leader-alt-key "M-SPC")
#+END_SRC


+I like a little separation so I put an empty line at the top of my emacs+
+instance (I may put something in it later)+

I never did as i moved to multi monitors
#+BEGIN_SRC emacs-lisp
;; (setq-default header-line-format (concat (propertize battery-mode-line-format 'display '((space :align-to 0))) " ")))
#+END_SRC

for those random scripts I find
#+begin_src emacs-lisp
(add-load-path! "lisp")
#+end_src
** Keybinds
These are my global keybinds they should not belong to any module. thus they
get stuck here
#+BEGIN_SRC emacs-lisp
(map!
 :n "z C-w" 'save-buffer ; I can use this onehanded which is nice when I need to leave or eat or something
 :g "C-`" #'+workspace/other ; faster than SPC w `
 :leader
 :desc "Enable Coloured Values" "t c" #'rainbow-mode
 :desc "Toggle Tabs" "t B" #'centaur-tabs-local-mode
 :desc "Open Elfeed" "o l" #'=rss
 :desc "Open Irc" "o c" #'=irc
 ;; I recompile more than I compile
 "cc" #'recompile
 "cC" #'compile)

(map! :map minibuffer-local-map doom-leader-alt-key #'doom/leader)
#+end_src
** Hooky hooks
hl-line and rainbow mode don't play all too well so if one is on the other
should be off
#+begin_src emacs-lisp
(add-hook! 'rainbow-mode-hook
  (hl-line-mode (if rainbow-mode -1 +1)))
#+end_src

#+BEGIN_SRC emacs-lisp
(remove-hook 'text-mode-hook #'visual-line-mode)
(add-hook 'text-mode-hook #'auto-fill-mode)
#+END_SRC
** cli commands
this adds a repl command so that I can run emacs lisp in a terminal repl. is it
useful? no is it cool? yes. is it mine? no thanks @tecosaur!

#+begin_src emacs-lisp :tangle packages.el
(package! engrave-faces
  :recipe (:host github :repo "tecosaur/engrave-faces"))
#+end_src

#+begin_src emacs-lisp :tangle cli.el
(defcli! repl ((in-rlwrap-p ["--rl"] "For internal use only."))
  "Start an elisp REPL."
  (when (and (executable-find "rlwrap") (not in-rlwrap-p))
    ;; For autocomplete
    (setq autocomplete-file "/tmp/doom_elisp_repl_symbols")
    (unless (file-exists-p autocomplete-file)
      (princ "\e[0;33mInitialising autocomplete list...\e[0m\n")
      (with-temp-buffer
        (cl-do-all-symbols (s)
          (let ((sym (symbol-name s)))
            (when (string-match-p "\\`[[:ascii:]][[:ascii:]]+\\'" sym)
              (insert sym "\n"))))
        (write-region nil nil autocomplete-file)))
    (princ "\e[F")
    (throw 'exit (list "rlwrap" "-f" autocomplete-file
                       (concat doom-emacs-dir "bin/doom") "repl" "--rl")))

  (doom-initialize-packages)
  (require 'engrave-faces-ansi)
  (setq engrave-faces-ansi-color-mode '3-bit)

  ;; For some reason (require 'parent-mode) doesn't work :(
  (defun parent-mode-list (mode)
    "Return a list of MODE and all its parent modes.

The returned list starts with the parent-most mode and ends with MODE."
    (let ((result ()))
      (parent-mode--worker mode (lambda (mode)
                                  (push mode result)))
      result))
  (defun parent-mode--worker (mode func)
    "For MODE and all its parent modes, call FUNC.

FUNC is first called for MODE, then for its parent, then for the parent's
parent, and so on.

MODE shall be a symbol referring to a function.
FUNC shall be a function taking one argument."
    (funcall func mode)
    (when (not (fboundp mode))
      (signal 'void-function (list mode)))
    (let ((modefunc (symbol-function mode)))
      (if (symbolp modefunc)
          ;; Hande all the modes that use (defalias 'foo-parent-mode (stuff)) as
          ;; their parent
          (parent-mode--worker modefunc func)
        (let ((parentmode (get mode 'derived-mode-parent)))
          (when parentmode
            (parent-mode--worker parentmode func))))))
  (provide 'parent-mode)
  ;; Some extra highlighting (needs parent-mode)
  (require 'rainbow-delimiters)
  (require 'highlight-quoted)
  (require 'highlight-numbers)
  (setq emacs-lisp-mode-hook '(rainbow-delimiters-mode
                               highlight-quoted-mode
                               highlight-numbers-mode))
  ;; Pretty print
  (defun pp-sexp (sexp)
    (with-temp-buffer
      (cl-prettyprint sexp)
      (emacs-lisp-mode)
      (font-lock-ensure)
      (with-current-buffer (engrave-faces-ansi-buffer)
        (princ (string-trim (buffer-string)))
        (kill-buffer (current-buffer)))))
  ;; Now do the REPL
  (defvar accumulated-input nil)
  (while t
    (condition-case nil
        (let ((input (if accumulated-input
                         (read-string "\e[31m .\e[0m  ")
                       (read-string "\e[31mλ:\e[0m "))))
          (setq input (concat accumulated-input
                              (when accumulated-input "\n")
                              input))
          (cond
           ((string-match-p "\\`[[:space:]]*\\'" input)
            nil)
           ((string= input "exit")
            (princ "\n") (kill-emacs 0))
           (t
            (condition-case err
                (let ((input-sexp (car (read-from-string input))))
                  (setq accumulated-input nil)
                  (pp-sexp (eval input-sexp))
                  (princ "\n"))
              ;; Caused when sexp in unbalanced
              (end-of-file (setq accumulated-input input))
              (error
               (cl-destructuring-bind (backtrace &optional type data . _)
                   (cons (doom-cli--backtrace) err)
                 (princ (concat "\e[1;31mERROR:\e[0m " (get type 'error-message)))
                 (princ "\n       ")
                 (pp-sexp (cons type data))
                 (when backtrace
                   (print! (bold "Backtrace:"))
                   (print-group!
                    (dolist (frame (seq-take backtrace 10))
                      (print!
                       "%0.74s" (replace-regexp-in-string
                                 "[\n\r]" "\\\\n"
                                 (format "%S" frame))))))
                 (princ "\n")))))))
      ;; C-d causes an end-of-file error
      (end-of-file (princ "exit\n") (kill-emacs 0)))
    (unless accumulated-input (princ "\n"))))
#+end_src
