config/doom/packages.el
(package! engrave-faces
  :recipe (:host github :repo "tecosaur/engrave-faces"))
