config/doom/config.org
** funky functions
Because this is a literate config I can't re evaluate the buffer using
~eval-buffer~ (bound to =SPC m e b=) so I reload the file after its tangled (usually
on save)
(=m e b= becomes =h r c=)
#+BEGIN_SRC emacs-lisp :tangle autoload.el
;;;###autoload
(defun yeet/reload ()
  "A simple cmd to make reloading my config easier"
  (interactive)
  (load! "config" doom-private-dir)
  (message "Reloaded!"))
#+END_SRC

#+begin_src emacs-lisp
(map! :leader
      "h r c" #'yeet/reload)
#+end_src
some how this function is run on startup? not that I am complaining
#+BEGIN_SRC emacs-lisp :tangle autoload.el
;;;###autoload
(defun henlo ()
  "henlo."
  (interactive)
  (message "henlo"))

(henlo) ;; oh wait thats how

#+END_SRC

I don't have a problem ok I can =M-x stop= at any time
#+begin_src emacs-lisp :tangle autoload.el
;;;###autoload
(defun stop ()
  (interactive)
  (let ((name "*I can quit at any time*"))
    (switch-to-buffer (get-buffer-create name))
    (insert "I can stop at any time\nI am in control")))
#+end_src

thewe awe days whewe i nyeed to quickwy u-uwu a wawge a-amount of text w-wight in emacs
o-onwy wowks on an e-expwicit sewection a-at the moment [[https://github.com/Daniel-Liu-c0deb0t/uwu][this is the pwogwam i
use]] tho it couwd wowk with any uwu pwogwam t-that accepts s-stdin

#+begin_src emacs-lisp :tangle autoload.el
;;;###autoload
(defun uwu (start end)
  "Uwu the text between START and END."
  (interactive "r")
  (let ((str (buffer-substring-no-properties start end)))
    (goto-char start)
    (delete-region start end)
    (insert (format "%s" (shell-command-to-string ;; I have to pipe the text into uwuify unless making a temp-file is more your style
                          (concat "echo "
                                  "'" str "'"
                                  " | " (executable-find "uwuify")))))))
#+end_src

This snippet toggles between a vertical and horizontal window. Like most things
I did not write this I took it from [[https://www.emacswiki.org/emacs/ToggleWindowSplit][here]]
#+begin_src emacs-lisp :tangle autoload.el
;;;###autoload
(defun toggle-window-split ()
  (interactive)
  (if (= (count-windows) 2)
      (let* ((this-win-buffer (window-buffer))
             (next-win-buffer (window-buffer (next-window)))
             (this-win-edges (window-edges (selected-window)))
             (next-win-edges (window-edges (next-window)))
             (this-win-2nd (not (and (<= (car this-win-edges)
                                         (car next-win-edges))
                                     (<= (cadr this-win-edges)
                                         (cadr next-win-edges)))))
             (splitter
              (if (= (car this-win-edges)
                     (car (window-edges (next-window))))
                  'split-window-horizontally
                'split-window-vertically)))
        (delete-other-windows)
        (let ((first-win (selected-window)))
          (funcall splitter)
          (if this-win-2nd (other-window 1))
          (set-window-buffer (selected-window) this-win-buffer)
          (set-window-buffer (next-window) next-win-buffer)
          (select-window first-win)
          (if this-win-2nd (other-window 1))))))
#+end_src

#+begin_src emacs-lisp
(defun ar/consult-apple-search ()
  "Ivy interface for dynamically querying apple.com docs."
  (interactive)
  (require 'request)
  (require 'json)
  (require 'url-http)
  (consult--read "apple docs: "
            (lambda (input)
              (let* ((url (url-encode-url (format "https://developer.apple.com/search/search_data.php?q=%s" input)))
                     (c1-width (round (* (- (window-width) 9) 0.3)))
                     (c2-width (round (* (- (window-width) 9) 0.5)))
                     (c3-width (- (window-width) 9 c1-width c2-width)))
                (let ((request-curl-options (list "-H" (string-trim (url-http-user-agent-string)))))
                   (request url
                     :type "GET"
                     :parser 'json-read
                     :success (cl-function
                               (lambda (&key data &allow-other-keys)
                                 (ivy-update-candidates
                                  (mapcar (lambda (item)
                                            (let-alist item
                                              (propertize
                                               (format "%s   %s   %s"
                                                       (truncate-string-to-width (propertize (or .title "")
                                                                                             'face '(:foreground "yellow")) c1-width nil ?\s "…")
                                                       (truncate-string-to-width (or .description "") c2-width nil ?\s "…")
                                                       (truncate-string-to-width (propertize (string-join (or .api_ref_data.languages "") "/")
                                                                                             'face '(:foreground "cyan1")) c3-width nil ?\s "…"))
                                               'url .url)))
                                          (cdr (car data)))))))
                   0)))
            ;; :action (lambda (selection)
            ;;           (browse-url (concat "https://developer.apple.com"
            ;;                               (get-text-property 0 'url selection))))
            ;; :dynamic-collection t
            ;; :caller 'ar/counsel-apple-search)
  ))

#+end_src

#+begin_src emacs-lisp
(map! :leader
      "w C-t" nil
      "w C-t" #'toggle-window-split)
#+end_src

I need more cats in my life
#+begin_src emacs-lisp
(defvar yeet/insert-cat-width nil
  "the width of the cats")

(defun yeet/insert-cat ()
  (interactive)
  (insert-before-markers
   (shell-command-to-string
    (format "jp2a --width= %s https://cataas.com/cat" (if yeet/insert-cat-width
                                                          yeet/insert-cat-width
                                                        60)))))
#+end_src
** macros
this is a small helper macro that wraps ~with-temp-buffer~ with an implicit call
to ~buffer-string~ I did this as I see this patter all over the place and
#+begin_src emacs-lisp
(defmacro with-temp-buffer! (&rest BODY)
  "A wrapper around `with-temp-buffer' that implicitly calls `buffer-string'
This is in an effort to streamline a very common usecase"
  (declare (indent 0) (debug t))
  `(with-temp-buffer
     (progn ,@BODY)
     (buffer-string)))
#+end_src

#+begin_src emacs-lisp :tangle no
(message "%s" (with-temp-buffer!
                (insert "hello\n")
                (insert "world!")))
#+end_src

#+RESULTS:
: hello
: world!

#+begin_src emacs-lisp
;; I plan on upstreamin this.
(defmacro thread-as (initial-form var &rest forms)
  "Thread INITIAL-FORM through FORMS as VAR to there successor.
Example:
     (thread-as
       5
       my-var
       (+ my-var 20)
       (/ 25 my-var)
       (+ my-var 40))
Is equivalent to:
     (+ (/ 25 (+ 5 20)) 40 )
Note that unlike the other threading macro's that every call needs to
explicitly use the variable."
  `(let* ,(mapcar (lambda (form)
                    (list var form))
                  (cons initial-form forms))
     ,var))

(thread-as 3 my-var (+ 2 my-var) (+ 4 my-var))
#+end_src

** Random modes
*** display time mode
#+begin_src emacs-lisp
(display-time-mode +1)
#+end_src
*** GlobalSubWord Mode
#+begin_src emacs-lisp
(global-subword-mode +1)
#+end_src
*** TODO Type break mode
Type break reminds you too take a break once a certain threshold of keys has
been met. Its nice if its not too frequent
#+begin_src emacs-lisp
(use-package! type-break
  :defer
  :config
  (setq type-break-interval 1800 ;; half an hour between type breaks
        type-break-keystroke-threshold (cons 2000  14000))
  (type-break-mode 1))
#+end_src
*** Battery mode
I like my modeline busy
#+begin_src emacs-lisp
(display-battery-mode 1)
#+end_src
*** whitespace mode
#+begin_src emacs-lisp
(setq whitespace-style '(space-mark))
(setq whitespace-display-mappings '((space-mark 32 [183] [46])))
(global-whitespace-mode)
#+end_src
** popup rules
#+begin_src emacs-lisp
(set-popup-rules!
  '(("^\\*info\\*"
     :slot 1 :vslot 1 :side right :width 0.45 :quit nil)))
#+end_src
* Packages
I have quite a few packages that I use. These are the packages and there
subsequent configurations.
Here they are organised into the catagories and modules they would be if they
were doom modules
#+BEGIN_SRC emacs-lisp :tangle packages.el
;; -*- no-byte-compile: t; -*-
;;; $DOOMDIR/packages.el
#+END_SRC
** ui
*** modeline fun :modeline:
/whats life without a little colour?/
#+begin_src emacs-lisp :tangle packages.el
(package! nyan-mode)
(package! parrot)
#+end_src

#+begin_src emacs-lisp
(defvar yeet/birds '(default confused emacs nyan rotating science thumbsup))

(use-package! nyan-mode
  :after doom-modeline
  :config
  (setq nyan-bar-length 15
        nyan-wavy-trail t)
  (nyan-mode +1)
  (nyan-start-animation))

(use-package! parrot
  :defer t
  :config
  (parrot-set-parrot-type (nth (random (length yeet/birds)) yeet/birds)) ;; this chooses a random bird on startup
  (parrot-mode +1)
  (parrot-start-animation))

;; (add-to-list 'marginalia-prompt-categories '("bird" . bird))

(defun bird-annotations (cand)
  "Takes a CANDidate (which is a bird) and returns a description of said bird"
  (let ((yeet/birds+annotations (-zip-pairs yeet/birds '("default bird is best bird"
                                                         "they have got the spirit"
                                                         "EMACS BIRD EMACS BIRD"
                                                         "nananananan"
                                                         "you spin me right round right round like a record baby"
                                                         "science bitch!"
                                                         "He is just happy to be here"))))
    (cdr (assoc cand yeet/birds+annotations))))

;; (add-to-list 'marginalia-annotator-registry '(bird bird-annotations))
#+end_src

#+begin_src emacs-lisp :tangle autoload.el
;;;###autoload
(defun yeet/select-bird (bird)
  "Select BIRD from birds"
  (interactive (list (completing-read "Select bird: " birds)))
  (parrot-set-parrot-type bird))
#+end_src
*** sidebars :sidebars:
By virtue of these things I seem to have 3 different sidebars (4 if you include
treemacs) that I have taken a liking to so they get there own sub genre

#+begin_src emacs-lisp
(defun yeet/sidebar-toggle ()
  "toggle both ibuffer and dired sidebars"
  (interactive)
  (ibuffer-sidebar-toggle-sidebar)
  (dired-sidebar-toggle-sidebar))

(map! :leader "o p" nil
      :leader "o p" #'dired-sidebar-toggle-sidebar ;; this is more useful most of the time
      :leader "o P" #'yeet/sidebar-toggle) ;; this is when I need too do some buffer management
#+end_src

**** Dired sidebar
this is a replacement for treemacs. Now don't get me wrong. I like treemacs. Its
great but its /not dired/. This preserves a lot of the dired configuration I could
do and more importantly preserves keys which is nice
#+begin_src emacs-lisp :tangle packages.el
(package! dired-sidebar)
#+end_src

#+begin_src emacs-lisp
;; (after! dired-sidebar (add-hook! 'dired-sidebar-mode-hook (doom-modeline-mode -1)))

(use-package! dired-sidebar
  :defer t
  :commands dired-sidebar-toggle-sidebar
  :config
  (setq dired-sidebar-use-custom-modeline t
        dired-sidebar-should-follow-file t))
#+end_src

**** Ibuffer sidebar
this is the same thing as above made by the same [[https://github.com/jojojames][author]] and it works just like
dired sidebar.. for Ibuffer
#+begin_src emacs-lisp :tangle packages.el
(package! ibuffer-sidebar)
#+end_src

#+begin_src emacs-lisp
(use-package! ibuffer-sidebar
  :commands ibuffer-sidebar-toggle-sidebar
  :defer t)
#+end_src
**** TODO Org Sidebar
this does a bunch of org stuff like break stuff down into headings. there is a
bit of work to be done
#+begin_src emacs-lisp :tangle packages.el
(package! org-sidebar)
#+end_src


#+begin_src emacs-lisp
(use-package! org-sidebar
  :after org)
#+end_src
*** themes
I set my themes in my  [[#doom][Doom config]]
#+begin_src emacs-lisp :tangle packages.el
(package! ef-themes :recipe (:host nil :repo "https://git.sr.ht/~protesilaos/ef-themes"))
(package! tao-theme)
#+end_src

#+begin_src emacs-lisp
(use-package ef-themes :defer t)

(use-package! tao-theme ; messing around with tao
  :defer
  :config
  (setq tao-theme-use-sepia t
        tao-theme-sepia-depth 50))
#+end_src
** checkers
*** COMMENT syntax
this is now a module doomemacs/doomemacs#6660
I have swapped out flycheck for flymake for a couple of reasons
- its built in
- its an easy switch
- its probably what doom is going to switch to
- 4th reason
#+begin_src emacs-lisp
(add-hook! (prog-mode text-mode) #'flymake-mode)

(after! lsp-mode
  (setq lsp-diagnostics-provider :flymake))

(after! flymake
  (setq flymake-fringe-indicator-position 'right-fringe))
#+end_src
**** popon hover
#+begin_src emacs-lisp :tangle packages.el
(package! popon :recipe (:repo "https://codeberg.org/akib/emacs-popon"))
(package! flymake-popon :recipe (:repo "https://codeberg.org/akib/emacs-flymake-popon"))
#+end_src

#+begin_src emacs-lisp
(use-package! flymake-popon
  :hook (flymake-mode . flymake-popon-mode))
#+end_src
**** remove checkdoc in certain buffers
#+begin_src emacs-lisp
(add-hook! 'flymake-mode-hook
  (defun +emacs-lisp-reduce-flymake-errors-in-emacs-config-h ()
    (when (and (bound-and-true-p flymake-mode)
               (eq major-mode 'emacs-lisp-mode)
               (cl-find-if (doom-partial #'file-in-directory-p default-directory)
                           +emacs-lisp-disable-flycheck-in-dirs))
      (remove-hook 'flymake-diagnostic-functions #'elisp-flymake-checkdoc))))
#+end_src

*** Flymake Vale
this replaces =:checkers grammer= and parts of =:checkers spell=
#+begin_src emacs-lisp :tangle packages.el
(package! flymake-vale :recipe (:host github :repo "tpeacock19/flymake-vale"))
#+end_src

#+begin_src emacs-lisp
(use-package! flymake-vale
  :hook ((text-mode       . flymake-vale-load)
         (latex-mode      . flymake-vale-load)
         (org-mode        . flymake-vale-load)
         (markdown-mode   . flymake-vale-load)
         (message-mode    . flymake-vale-load)))

(add-hook! 'org-msg-mode-hook
  (setq flymake-vale-file-ext ".org")
  (flymake-vale-load))
#+end_src

** emacs
*** dired :dired:
I want drag and drop so I just wrapped dragon in elisp the drag commands work
wellish
#+begin_src emacs-lisp :tangle packages.el
;; (package! dired-dragon :recipe (:local-repo "~/code/emacs/dired-dragon"
;;                                 :build (:not compile)))
(package! dired-dragon :recipe (:host github :repo "jeetelongname/dired-dragon"
                                :build (:not compile)))
#+end_src

#+begin_src emacs-lisp
(use-package! dired-dragon
  :after dired
  :config
  (map! :map dired-mode-map
        (:prefix "C-s"
         :n "d" #'dired-dragon
         :n "s" #'dired-dragon-stay
         :n "i" #'dired-dragon-individual)))
#+end_src

** tools
