config/doom/packages.el

;; -*- no-byte-compile: t; -*-
;;; $DOOMDIR/packages.el

(package! nyan-mode)
(package! parrot)

(package! dired-sidebar)

(package! ibuffer-sidebar)

(package! org-sidebar)

(package! dired-dragon :recipe (:local-repo "~/code/emacs/dired-dragon"
                                :build (:not compile)))
;; (package! dired-dragon :recipe (:host github :repo "jeetelongname/dired-dragon"))
