config/doom/config.org
*** pretty code shots
i missed the ability to make pretty code shots inside vscode now its come back to
me through this package. its pretty cool and works well (it only does one thing)
#+begin_src emacs-lisp :tangle packages.el
(package! carbon-now-sh)
#+end_src

+i wanted to work with these code images directly in emacs so i brought in eaf to+
+help. do note that there is a bug in the pypi version of the qtwebengine that+
+basically segfaults if you open carbon (and probably other sites) if you install
from the repos tho this problem goes away+

I just went back to firefox since eaf is deprecated in my config
#+begin_src emacs-lisp
(use-package! carbon-now-sh
  :config
  (defun yeet/carbon-use-eaf ()
    (interactive)
    (split-window-right)
    (let ((browse-url-browser-function 'browse-url-firefox))
      (browse-url (concat carbon-now-sh-baseurl "?code="
                          (url-hexify-string (carbon-now-sh--region))))))
  (map! :n "g C-c" #'yeet/carbon-use-eaf))
#+end_src

#+begin_src emacs-lisp :tangle packages.el
;; (package! screenshot. :recipe
;;   (:host github :repo "tecosaur/screenshot"))
#+end_src

#+begin_src emacs-lisp
;; (use-package! screenshot :defer)
#+end_src
*** snippets
I really need to play with snippets more
I need more gremlins
#+begin_src emacs-lisp :tangle packages.el
(package! aas)
(package! tempel)
#+end_src

#+begin_src emacs-lisp
(use-package! aas)
#+end_src
*** dictionary
tecosaurs [[https://github.com/tecosaur/lexic][lexic]] package is now powering my dictionary usage, This configuration
is basically stolen from [[https://tecosaur.github.io/emacs-config/config.html#dictionary][his config]] (like most things)

#+begin_src emacs-lisp :tangle packages.el
(package! lexic)
#+end_src

#+begin_src emacs-lisp
(use-package! lexic
  :commands lexic-search lexic-list-dictionary
  :config
  (map! :map lexic-mode-map
        :n "q" #'lexic-return-from-lexic
        :nv "RET" #'lexic-search-word-at-point
        :n "a" #'outline-show-all
        :n "h" (cmd! (outline-hide-sublevels 3))
        :n "o" #'lexic-toggle-entry
        :n "n" #'lexic-next-entry
        :n "N" (cmd! (lexic-next-entry t))
        :n "p" #'lexic-previous-entry
        :n "P" (cmd! (lexic-previous-entry t))
        :n "E" (cmd! (lexic-return-from-lexic) ; expand
                     (switch-to-buffer (lexic-get-buffer)))
        :n "M" (cmd! (lexic-return-from-lexic) ; minimise
                     (lexic-goto-lexic))
        :n "C-p" #'lexic-search-history-backwards
        :n "C-n" #'lexic-search-history-forwards
        :n "/" (cmd! (call-interactively #'lexic-search))))
#+end_src

#+begin_src emacs-lisp
(defadvice! +lookup/dictionary-definition-lexic (identifier &optional arg)
  "Look up the definition of the word at point (or selection) using `lexic-search'."
  :override #'+lookup/dictionary-definition
  (interactive
   (list (or (doom-thing-at-point-or-region 'word)
             (read-string "Look up in dictionary: "))
         current-prefix-arg))
  (lexic-search identifier nil nil t))
  #+end_src
*** info
#+begin_src emacs-lisp :tangle packages.el
(package! info-colors)
(package! info-buffer)
#+end_src

#+begin_src emacs-lisp
(use-package info-colors
  :hook (Info-selection-hook . info-colors-fontify-node))

;; (map! "C-h i" #'info-buffer)
#+end_src
** lang
*** org mode
**** TODO Company org block
#+begin_src emacs-lisp :tangle packages.el
(package! company-org-block)
#+end_src

#+begin_src emacs-lisp
(use-package! company-org-block
  :after org
  :config
  (setq company-org-block-edit-style 'auto))

(after! org
  (set-company-backend! 'org-mode-hook '(company-org-block company-capf))

  ;; (setq org-babel-load-languages
  ;;       '((elisp   . t)
  ;;         (python  . t)
  ;;         (ruby    . t)
  ;;         (haskell . t)
  ;;         (scheme  . t)
  ;;         (latex   . t)))
  )

#+end_src

**** Org pandoc import
#+begin_src emacs-lisp :tangle packages.el
(package! org-pandoc-import
  :recipe (:host github
           :repo "tecosaur/org-pandoc-import"
           :files ("*.el" "filters" "preprocessors")))
#+end_src

#+begin_src emacs-lisp
(use-package! org-pandoc-import :after org)
#+end_src

**** org roam :org:roam:
#+begin_src emacs-lisp :tangle packages.el
(unpin! org-roam)
(package! websocket)
(package! org-roam-ui :recipe (:host github :repo "org-roam/org-roam-ui" :files ("*.el" "out")))
#+end_src

#+begin_src emacs-lisp
(use-package! websocket
  :after org-roam)

(use-package! org-roam-ui
  :after org-roam
  :config
  (setq org-roam-ui-sync-theme t
        org-roam-ui-follow t
        org-roam-ui-update-on-save t
        org-roam-ui-open-on-start t))
#+end_src
**** org modern

#+begin_src emacs-lisp :tangle packages.el
(package! org-modern)
#+end_src

#+begin_src emacs-lisp
(use-package! org-modern :defer t)
#+end_src
**** org-remark
#+begin_src emacs-lisp :tangle packages.el
(package! org-remark)
#+end_src

#+begin_src emacs-lisp
(use-package! org-remark
   :defer t
   :init
   (map! :g "C-c n m" #'org-remark-mark
         (:after org-remark
          (:map org-remap-mode-map
           (:prefix "C-c n"
            :g "o" #'org-remark-open
            :g "]" #'org-remark-view-next
            :g "[" #'org-remark-view-previous
            :g "r" #'org-remark-remove)))))
#+end_src
**** simple-comment-markup
#+begin_src emacs-lisp :tangle packages.el
(package! simple-comment-markup :recipe (:repo "https://git.tecosaur.net/tec/simple-comment-markup.git"))
#+end_src

#+begin_src emacs-lisp
(use-package simple-comment-markup
  :hook (org-mode . simple-comment-markup-mode))
#+end_src

*** emacs lisp :emacsLisp:
in the ever growing emacs ecosystem the amount of prefixes you can use are
shrinking and as microcosoms open up and connections need to be reenforced it
all leads us down the slippery slope of ever lengthening prefixes. this godly
package shortens them to make reading code a lot easier
#+begin_src emacs-lisp :tangle packages.el
(package! nameless)
#+end_src

#+begin_src emacs-lisp
(use-package! nameless
  :defer t
  :hook (emacs-lisp-mode-hook . nameless-mode)
  :config
  (setq nameless-global-aliases '(("d" . "doom"))
        nameless-private-prefix t)

  (map! :map emacs-lisp-mode-map
        :localleader
        "i" #'nameless-insert-name))
#+end_src
*** TODO SQL
#+begin_src emacs-lisp
(after! sql
  (add-to-list 'sql-connection-alist
               '(psql (sql-product 'postgres)
                      (sql-port 22)
                      (sql-server (read-from-minibuffer "server ip: ")))))
#+end_src

*** Caddy
Caddy is a webserver with its own file format
#+begin_src emacs-lisp :tangle packages.el
(package! caddyfile-mode)
#+end_src

#+begin_src emacs-lisp
(use-package! caddyfile-mode
  :mode (("Caddyfile\\'" . caddyfile-mode)
         ("caddy\\.conf\\'" . caddyfile-mode)))
#+end_src
*** TODO vim
because sacrilege is fun
(this is mostly a mental exercise but it does work...) I can (alleged) also get lsp
support as well so this may be a fun project to take on
#+begin_src emacs-lisp :tangle packages.el
(package! vimrc-mode)
#+end_src

#+begin_src emacs-lisp
(use-package! vimrc-mode
  :mode "\\.vim$\\'"
  :config)
;; (sp-local-pair 'vimrc-mode "\"" nil :actions :rem))
#+end_src
*** TODO unit tests
While I am in fact an incompetent programmer I do enjoy the sysiphisan task of
writing tests +thanks in no small part to the ease that cucumber makes it+
I was so ready to use it but it did not want too work with my ruby project :(

#+begin_src emacs-lisp :tangle packages.el
(package! feature-mode)
#+end_src

#+begin_src emacs-lisp
(use-package! feature-mode
  :mode "\\.feature$\\'")
#+end_src
*** COMMENT Brainfuck
me get errors need fix
#+begin_src emacs-lisp :tangle packages.el
(package! brainfuck-mode)
#+end_src

#+begin_src emacs-lisp
(use-package! brainfuck-mode
  :mode "\\.bf$\\'")
#+end_src
*** janet
#+begin_src emacs-lisp :tangle packages.el
(package! janet-mode :recipe
  (:host github :repo "ALSchwalm/janet-mode"))
#+end_src

#+begin_src emacs-lisp
(use-package! janet-mode
  :mode "\\.janet$\\'")
#+end_src
*** shell
#+begin_src emacs-lisp :tangle packages.el
(package! flymake-shellcheck)
#+end_src

#+begin_src emacs-lisp
(use-package! flymake-shellcheck
  :commands flymake-shellcheck-load
  :init
  (add-hook 'sh-mode-hook 'flymake-shellcheck-load))
#+end_src

** app
*** books :books:
I am starting to read more books and papers online so it makes sense to include
improve the experience somewhat
#+begin_src emacs-lisp :tangle packages.el
(package! nov)
(package! calibredb)
(package! olivetti)
(package! mixed-pitch)
#+end_src

Calibredb provides a nice interface for exploring adding and working with ebooks
I have stolen most of these keybinding from [[https://tecosaur.github.io/emacs-config/config.html#ebooks][@tecosaur]] (thanks for doing this
work so I don't have to) I have slightly modified them though to fit my needs.
#+begin_src emacs-lisp
(use-package! calibredb
  :defer t
  :config
  (setq calibredb-root-dir "~/Documents/reading/calibre"
        calibredb-db-dir   (expand-file-name "metadata.db" calibredb-root-dir))
  ;; the view for all books
  (map! :map calibredb-search-mode-map
        :ne "?" #'calibredb-entry-dispatch
        :ne "a" nil
        :ne "a" #'calibredb-add
        :ne "A" nil
        :ne "A" #'calibredb-add-dir
        :ne "." #'calibredb-open-dired
        :ne "e" #'calibredb-export-dispatch
        :ne "m" #'calibredb-mark-at-point
        :ne "o" #'calibredb-find-file
        :ne "O" #'calibredb-find-file-other-frame
        :ne "q" #'calibredb-search-quit
        :ne "s" nil
        :ne "s" #'calibredb-sort-dispatch
        :ne "S" #'calibredb-set-metadata-dispatch
        :ne "u" #'calibredb-unmark-at-point
        :ne "V" #'calibredb-open-file-with-default-tool
        :ne [tab] #'calibredb-toggle-view-at-point)
  ;; the veiw for one book
  (map! :map calibredb-show-mode-map
        :ne [mouse-3] #'calibredb-search-mouse
        :ne "RET" #'calibredb-find-file
        :ne "?" #'calibredb-dispatch
        :ne "a" #'calibredb-add
        :ne "A" #'calibredb-add-dir
        :ne "c" #'calibredb-clone
        :ne "d" #'calibredb-remove
        :ne "D" #'calibredb-remove-marked-items
        :ne "j" #'calibredb-next-entry
        :ne "k" #'calibredb-previous-entry
        :ne "l" #'calibredb-virtual-library-list
        :ne "L" #'calibredb-library-list
        :ne "n" #'calibredb-virtual-library-next
        :ne "N" #'calibredb-library-next
        :ne "p" #'calibredb-virtual-library-previous
        :ne "P" #'calibredb-library-previous
        :ne "s" #'calibredb-set-metadata-dispatch
        :ne "S" #'calibredb-switch-library
        :ne "o" #'calibredb-find-file
        :ne "O" #'calibredb-find-file-other-frame
        :ne "v" #'calibredb-view
        :ne "V" #'calibredb-open-file-with-default-tool
        :ne "." #'calibredb-open-dired
        :ne "b" #'calibredb-catalog-bib-dispatch
        :ne "e" #'calibredb-export-dispatch
        :ne "r" #'calibredb-search-refresh-and-clear-filter
        :ne "R" #'calibredb-search-clear-filter
        :ne "q" nil
        :ne "q" #'calibredb-search-quit
        :ne "m" #'calibredb-mark-and-forward
        :ne "f" #'calibredb-toggle-favorite-at-point
        :ne "x" #'calibredb-toggle-archive-at-point
        :ne "h" #'calibredb-toggle-highlight-at-point
        :ne "u" #'calibredb-unmark-and-forward
        :ne "i" #'calibredb-edit-annotation
        :ne "DEL" #'calibredb-unmark-and-backward
        :ne [backtab] #'calibredb-toggle-view
        :ne [tab] #'calibredb-toggle-view-at-point
        :ne "M-n" #'calibredb-show-next-entry
        :ne "M-p" #'calibredb-show-previous-entry
        :ne "/" #'calibredb-search-live-filter
        :ne "M-t" #'calibredb-set-metadata--tags
        :ne "M-a" #'calibredb-set-metadata--author_sort
        :ne "M-A" #'calibredb-set-metadata--authors
        :ne "M-T" #'calibredb-set-metadata--title
        :ne "M-c" #'calibredb-set-metadata--comments))

(defun +book/quit ())

(defun =book ()
  (interactive)
  (if (modulep! :ui workspaces)
      (progn
        (+workspace-switch "*book*" t)
        (doom/switch-to-scratch-buffer)
        (calibredb)
        (+workspace/display))
    (calibredb)))

;; I read books more than I read files in my buffer
(map! :leader
      "ob" nil
      "ob" #'=book
      "oB" #'browse-url-of-file)
#+end_src

Nov is how we do the reading!
I don't configre it too much for the time being though I do plan on adding a
setup function that changes the theme and makes it pretty
#+begin_src emacs-lisp
(use-package! nov
  :mode ("\\.epub\\'" . nov-mode)
  :config
  (add-hook! 'nov-mode-hook #'olivetti-mode ;; Centers the text making it easier to read
    (mixed-pitch-mode +1)
    (defun yeet/nov-setup ()
      (setq-local olivetti-body-width 125))))

(after! olivetti)
#+end_src

#+RESULTS:
*** tldr integration
Ever wanted to.. not read a man page? me too. tldr is a good middle ground between
a lot of useless information and .. no information. Now in emacs!
#+BEGIN_SRC emacs-lisp :tangle packages.el
(package! tldr)
#+END_SRC

#+begin_src emacs-lisp
(use-package! tldr
  :config
  (setq tldr-directory-path (expand-file-name "tldr/" doom-etc-dir)) ;; don't be cluttering my work tree
  (setq tldr-enabled-categories '("common" "linux")))
#+end_src
*** rss
#+begin_src emacs-lisp :tangle packages.el
(package! elfeed-tube :recipe (:host github :repo "karthink/elfeed-tube"))
#+end_src

#+begin_src emacs-lisp
(use-package elfeed-tube
  :after elfeed
  :config
  (setq elfeed-tube-auto-fetch-p t) ;;  t is auto-fetch (default)
  (elfeed-tube-setup)

  :bind (:map elfeed-show-mode-map
         ("F" . elfeed-tube-fetch)
         ([remap save-buffer] . elfeed-tube-save)
         :map elfeed-search-mode-map
         ("F" . elfeed-tube-fetch)
         ([remap save-buffer] . elfeed-tube-save)))
#+end_src
** other
*** tetris
who does not like a good game of tetris
#+begin_src emacs-lisp
;; center the board
(add-hook! 'tetris-mode-hook
           (defun yeet/center-tetris ()
             (setq-local olivetti-body-width 102)
             (olivetti-mode +1)))

(map! :after tetris
      :map tetris-mode-map
      :n "g" #'tetris-move-bottom
      :n "n" #'tetris-start-game
      :n "p" #'tetris-pause-game)
#+end_src

*** fixes
#+begin_src emacs-lisp :tangle packages.el
(package! xref :pin "a82f459b37b31546bf274388baf8aca79e9c30d9")
#+end_src

#+begin_src emacs-lisp :tangle packages.el
(package! gitconfig-mode
  :recipe (:host github :repo "magit/git-modes"
           :files ("gitconfig-mode.el")))
(package! gitignore-mode
  :recipe (:host github :repo "magit/git-modes"
           :files ("gitignore-mode.el")))

;; This is temporarily necessary due to an unrelated bug.
(unpin! gitignore-mode gitconfig-mode)
#+end_src
