config/doom/packages.el

(package! carbon-now-sh)

;; (package! screenshot. :recipe
;;   (:host github :repo "tecosaur/screenshot"))

(package! company-org-block)

(package! org-pandoc-import
  :recipe (:host github
           :repo "tecosaur/org-pandoc-import"
           :files ("*.el" "filters" "preprocessors")))

(unpin! org-roam)
(package! websocket)
(package! org-roam-ui :recipe (:host github :repo "org-roam/org-roam-ui" :files ("*.el" "out")))

(package! nameless)

(package! caddyfile-mode)

(package! vimrc-mode)

(package! feature-mode)

(package! janet-mode :recipe
  (:host github :repo "ALSchwalm/janet-mode"))

(package! nov)
(package! calibredb)
(package! olivetti)
(package! mixed-pitch)

(package! tldr)

(package! xref :pin "a82f459b37b31546bf274388baf8aca79e9c30d9")

(package! gitconfig-mode
  :recipe (:host github :repo "magit/git-modes"
           :files ("gitconfig-mode.el")))
(package! gitignore-mode
  :recipe (:host github :repo "magit/git-modes"
           :files ("gitignore-mode.el")))

;; This is temporarily necessary due to an unrelated bug.
(unpin! gitignore-mode gitconfig-mode)

(package! elcord)
