config/doom/config.org
*** rss :rss:
Elfeed is great. I just need more blogs

I am now kinda the maintainer of elfeed-goodies...
#+begin_src emacs-lisp :tangle packages.el
(package! elfeed-goodies
  :recipe (:local-repo "~/code/emacs/elfeed-goodies"
           :build (:not compile))
  :disable nil)
#+end_src

#+BEGIN_SRC emacs-lisp
(after! elfeed
  (setq elfeed-search-filter "@4-week-ago -fun") ;; /they post so much/

  (setq rmh-elfeed-org-files (list (concat org-directory "elfeed.org"))) ;; +org
  (add-hook! 'elfeed-search-mode-hook 'elfeed-update)) ; update on entry

(after! elfeed-goodies
  (setq elfeed-goodies/powerline-default-separator 'bar))

(defadvice! yeet/open-content-in-eww-a (orig-fun &rest args)
  :around #'elfeed-search-browse-url
  (let ((browse-url-browser-function #'eww-browse-url))
    (funcall orig-fun args)))
#+END_SRC

There have been times where I wanted to share a link to an interesting blog or a
comic that made me laugh. this just automated that process
#+begin_src emacs-lisp :tangle autoload.el
;; not actually useful as you can just use =title to filter by title
;;;###autoload
(defun yeet/search-feeds-by-title (feed-title)
  (interactive
   (list (completing-read
          "Select Feed"
          (let (feed-titles)
            (dolist (feed elfeed-feeds feed-titles)
              (push (cons (elfeed-feed-title (elfeed-entry-feed (car (elfeed-feed-entries (car feed)))))
                          (car feed))
                    feed-titles))))))
  (message "%s"  feed-title))
#+end_src

#+begin_src emacs-lisp
;; (map! (:map elfeed-show-mode-map
;;        :n "gc" nil
;;        :n "gc" #'yeet/elfeed-copy-link))
#+end_src

*** mu4e :mu4e:
Whats better than email? email in emacs! mu4e has been fine for me so I dont
think I will be switching to notmuch or what notj

Setting my email using ~set-email-acount~. its a simple affair If you are stuck
on the folders remember that they come from what you set in your [[https://github.com/jeetelongname/dotfiles/blob/master/mail/.mbsyncrc#L31][mail fetcher config]]
#+BEGIN_SRC emacs-lisp
(set-email-account! "gmail"
                    '((mu4e-sent-folder       . "/gmail/\[Gmail\]/Sent Mail")
                      (mu4e-drafts-folder     . "/gmail/\[Gmail\]/Drafts")
                      (mu4e-trash-folder      . "/gmail/\[Gmail\]/Trash")
                      (mu4e-refile-folder     . "/gmail/\[Gmail\]/All Mail")
                      (smtpmail-smtp-user     . "jeetelongname@gmail.com")
                      (org-msg-greeting-fmt   . "\nHi %s,\n\n")
                      (org-msg-signature      . "\nRegards,
 ,,#+begin_signature
 -- *Jeetaditya Chatterjee* \\\\
 /Sent using my text editor/
 ,,#+end_signature"))
                    t)
#+END_SRC

#+BEGIN_SRC emacs-lisp
(after! mu4e
  (setq mu4e-mu-version "1.8.10")
  (setq smtpmail-smtp-server "smtp.gmail.com"
        smtpmail-smtp-service 25))
#+END_SRC

I use msmtp to send my mail as its a little faster and has room for expansion
#+begin_src emacs-lisp
(setq sendmail-program (executable-find "msmtp")
      send-mail-function #'smtpmail-send-it
      message-sendmail-f-is-evil t
      message-sendmail-extra-arguments '("--read-envelope-from")
      message-send-mail-function #'message-send-mail-with-sendmail)
#+end_src

Adding some keybinding under local-leader. this should make it a little easier to
do mail stuff. I do like =C-c C-c= to send tho
#+begin_src emacs-lisp
(map! (:map org-msg-edit-mode-map
       :n "<tab>" #'org-msg-tab
       :localleader
       (:prefix "m"
        "k" #'org-msg-edit-kill-buffer
        "s" #'message-goto-subject
        "b" #'org-msg-goto-body
        "a" #'org-msg-attach)))
#+end_src

These are the settings for org-msg I may switch them to a snippet tho as I can
toggle the kind of signature I want to use then
#+BEGIN_SRC emacs-lisp
#+END_SRC

I don't like the default replied face
#+begin_src emacs-lisp
(custom-set-faces! `(mu4e-replied-face :foreground ,(doom-color 'red) :inherit font-lock-builtin-face))
#+end_src

I update my mail when I feel like it so this is a little redundant for me
#+begin_src emacs-lisp :tangle packages.el
(package! mu4e-alert :disable t)
#+end_src

*** everywhere :everywhere:
I prefer to write in the language that is going to be posted so markdown mode
makes more sense to be the default (which is org)
#+begin_src emacs-lisp
;; (after! emacs-everywhere
;;   (add-hook! 'emacs-everywhere-init-hooks 'markdown-mode)
;;   (remove-hook! 'emacs-everywhere-init-hooks 'org-mode))
#+end_src
* Epilogue
And that was my config! I hope you liked it! If you did not then you can make an
[[https://github.com/jeetelongname/.doom/issues][issue]] and if you just want to say I suck then i guess you can use that for that
too. I guess this is it for me... I am going back to bed
